{
  "module_id": "ED-01",
  "filename": "Echo Drift_ Scenes and Run of Module 1v3.txt",
  "content": "Echo Drift: Scenes and Run of Module 1, v3\nInsertion Scene 1: “Gunmetal Sky”\nScene Subtitle: \"Storm Front\"\n🌌 Setting:\n* Ship: CNS Vindicator, a mid-tier capital assault ship in the Voss Conflict\n* Location: Low orbit over the fractured moon of Kael-9\n* Player Role: Lt. Commander Iren Tazk, turret gunner commander, Bravo Battery, dorsal arc\n________________\n\nFIXED POINT - MANDATORY CINEMATIC: DO NOT SKIP OR MODIFY\n📽️ Opening Cinematic (GPT may paraphrase):\n\"Battle was chaos. It always was. But this time, it broke us.\"\nA string of red indicators blink across your console—missiles inbound. Dozens. Maybe hundreds.\nYou see the targeting telemetry scream past your eyes. Your gun crews call out trajectories. Then—\nSilence.\nThe forward starboard turret blooms into fire.\nThe comms fill with static, screams, nothing.\nYou ordered them to hold position. And now they're gone.\n________________\n\n\n🔀 Immediate Player Prompt (Turn 1):\nPrint prompt:\n“You are alone in the dorsal command pod. The rest of your crew is silent. You have 36 seconds before the second wave hits. What do you do?”\n________________\n\n\n🎯 Skill-Gated Scene Options (GPT interprets player intent):\nCharacter skills and scores influence the outcome. Tazk does not die.\n1. Redirect Power to Shields\n   * Skill: Mechanic (INT or EDU)\n   * Effect: Reduces next blast damage\n   * Echo Consequence: System stress degrades later navigation\n2. Evacuate to Internal Corridor\n   * Skill: Vacc Suit (DEX) or Athletics (END)\n   * Effect: Escape pod early; less injury\n   * Echo Consequence: Command logs lost\n3. Attempt to Save Bravo Battery Logs\n   * Skill: Electronics or Computer\n   * Effect: Logs preserved\n   * Echo Consequence: Dream layer includes echo NPCs of fallen crew\n4. Broadcast Final Orders to Surviving Gunners\n   * Skill: Leadership or Tactics\n   * Effect: May inspire AI or distant turrets\n   * Echo Consequence: Phantom gun crew may appear in dreams\n________________\n\n\n📍 Fixed Point: Missile Impact on Dorsal Section\nNarrative Anchor:\nThe CNS Vindicator's dorsal section is destroyed. This is a major story event initiating Scene 2.\nMust Occur:\n* Missile strike obliterates turret pod\n* Tazk is ejected or escapes into internal corridor\n* He is injured; oxygen drops to 16%\n* Scene 2 begins\nGPT Flex Zone:\n* How Tazk exits:\n   * If player evacuated → He dodges last moment, injury minor\n   * If saving logs or issuing orders → Thrown violently, injury severe\n   * If failed check → Consciousness fades, AI backup triggers emergency ejection\n* What is lost or preserved: Based on skill outcomes (logs, gear, hallucinations, oxygen mix)\n* Atmospheric cues: GPT may vary tone: explosive decompression, psychic dissonance, radio ghost fragments\nEcho Tag:\n* Impacts dream hallucinations and AI reactions in Module 2\n________________\n\n\nScene 2: “The Crawl”\n🛠️ Scene Transition:\nInterior corridor is collapsing\nAI voice distorted: “Structural integrity… 12%…”\nA dying crew member reaches toward you: “They’re not gone… I saw one move…”\nPlayer Choices:\n* Decide to help the crewman (may slow progress)\n* Retrieve final log entry from wall terminal (bonus XP or Echo consequence)\n* Navigate collapsing hallway (avoid debris—DEX or END check)\nScene Outcomes:\n* Helping crewman adds Echo tag: \"Witnessed Compassion\"\n* Failing to retrieve logs weakens later NPC recognition\n* Collision or success changes next scene’s physical state (injury, suit breach)\n________________\n\n\nScene 3: “The Final Transmission of the CNS Vindicator, by Iren Tazk”\nSetting:\n* Escape Pod 5-A\n* With or without wounded sailor\n* Pod auto-launches after player hits \"Escape\" button\nPlayer Tasks:\n1. Navigate debris field\n   * Skill Check: Pilot or INT\n   * On success → Smooth egress\n   * On failure → Pod grazes wreckage; must course-correct manually (2–3 obstacles)\n2. Manage Damage\n   * Skill: Mechanic or Electronics\n   * Repair navigation/shields, or risk further damage\n3. Sound Beacon and Enter Hypersleep\n   * GPT prints final log sequence\n   * Player may customize final message (optional flavor text)\n📍 Fixed Point: Scene Ends in Hypersleep\n* Tazk sees a proximity alert flicker briefly—unidentified\n* A red diagnostic warning begins flashing on the medscan HUD\n* His vision fades—no time left to interpret or respond\n* The sailor lies motionless beside him, but he’s already drifting under sedation\n* As he slips into hypersleep, the final image in his mind is the crew—standing as they once were\n* Their faces are whole, voices silent, the gun deck lit in peace\n* This image echoes forward\n________________\n\n\nEnd Module 1"
}