{
  "module_id": "ED-02",
  "filename": "Echo Drift_ Scenes and Run of Module 2v2.txt",
  "content": "Echo Drift: Scenes and Run of Module 2\nTitle: “Midnight Gale”\n\n🌌 OVERVIEW–these events occur over the span of 12 to 18 months.\nSetting: Mavros-V orbital station and subsurface trenches\nTone: Cold war paranoia, unraveling identity, covert action, psychological decay\nPlayer Character: Lt. Cmdr Iren Tazk (under forged identity)\nNarrative Function: Transition from reintegration attempt to psychological rupture and rogue exfiltration.\n\nFIXED POINT - MANDATORY CINEMATIC: DO NOT SKIP OR MODIFY\n🔹 Insertion Cinematic Scene 1: “Zone Drift”\nScene: Cargo Bay – Reintegration Zone 9C / 7A\nCinematic (printable):\nTazk wakes groggy in a stasis pod. Emergency lights flicker. A nearby sign alternates between ‘Zone 9C’ and ‘Zone 7A’. No one else reacts. Tazk says nothing.\nFixed Point: First Echo Drift\nEnvironmental signage shifts—visible to Tazk only\nA technician mutters: “That’s the third override today...”\nTazk proceeds in silence; this begins the memory bleed effect\n\n🔶 Scene 2: “Reintegration Interview”\nScene: CUUFAB Command Zone – Intake Room\nTasz is given a new name and realizes he needs to get back to his time in a planned, rational way. Chronosec has a record of the battle and his ship, but not him or the pod. He doesn’t know when or where he is, so it’s better to blend in and look for a way out than be a rebel from the beginning. He convinces a Chronosec intake officer that he can and should work.\nNPCs: Officer Rhess (Chronosec intake), PsyDept evaluator, temporal tech\nPlayer Interactions:\nDialogue skill checks (Admin, Persuade, Deception)\nQuestions about duty, losses, drift symptoms\nVoluntary or involuntary PsyDept scan (INT vs Will)\nFixed Point: Psychological Echo Tag Assigned\nLogs show zero physical corruption, but irregular dream state\nTazk’s Echo Tag is initiated (invisible to him)\n\n🔶 Scene 3: “Probationary Duty”\nScene: Observation Decks, Reactor Walks, EVA Prep\nTasks:\nReactor diagnostic\nExternal salvage assist\nSensor net recalibration\nGameplay:\nCommand or Engineering skill checks\nChance to impress or alert Chronosec\nFriend NPC introduced (Junior tech or logistics operator)\nEcho Drift 2 (Fixed Point):\nA hallway shifts. Tazk hits a wall where a door should be.\nCrew laughs. One jokes, “That’s three for Marrin!”\nTwo more Echo Drifts occur, Game Manager’s choice\nPlayer choice to react: internal monologue unlocks if they don’t speak\nThe drifts heighten his awareness of the need to go. They unknowingly invite scrutiny from Chronosec.\n\n🔶 Scene 4: “Subshell Descent”\nScene: Theta-14 Trench via mag-rail\nTasz now understands some of what’s going on with him. Through NPCs he finds out who Chronosec is and what they’re doing. Tasz is very wary but is beginning to trust people.\nObjective:\nInvestigate anomaly flagged by Dren Vallas\nEnvironmental hazard: collapsing rail, AI noise interference\nFixed Point: Echo Drift 3\nTazk hears Bravo Battery voices in static\nA warning light pulses in sequence from turret logs\nPlayer may suppress reaction or follow voices\nSkill Checks:\nPilot (rail nav), Vacc Suit (movement), Recon (mapping)\n\n🔶 Scene 5: “The Ardent Nix”\nScene: Buried Dart-class wreck, deep in trench wall\nBy now he understands wormholes and the history of the space around where he appeared.\nDiscovery:\nManual Field Integrity Modulator (FIM)\nNo power signature—officially erased\nGameplay:\nElectronics or Mechanic check to extract FIM\nStealth check to avoid auto-pings\nFixed Point: Echo Drift 4\nAs Tazk lifts the FIM, turret hum begins behind him\nA voice says: “Range set. Arc ready.” No one is there\nThe wreck hull feels warm—alive\n\n🔶 Scene 6: “Hangar 9”\nScene: Disguised grav-tunnel to hidden sub-hangar\nHe knows Chronosec is and will be looking at him. So he leans into not just looking like he’s assimilating, he starts making perhaps a friend. Meanwhile, Chronosec is actually looking at him. One day he’s suspect the other nothing to see.\nDiscovery:\nMidnight Gale: sublight prototype vessel\nNo registry, handwritten tag: “There & Back”\nGameplay:\nMemory trigger roll (INT or SOC)\nFlashback if Echo conditions met (Bravo Battery appears)\nFixed Point:\nTazk remembers the blast\nA breath of sand hits his teeth (phantom sensation)\nEmotional Drift locks in—player loses name of one fallen crewmate\n\n🔶 Scene 7: “The Ghost in the Mirror”\nScene: Barrack cube, post-shift\nTazk reflects on his growing ties—his name, memories fading. He has mapped three routes back to the wormhole. He knows Chronosec has eyes on him, so one of his routes will be along an old subsector that was once known as a smuggling route.\nPlayer Prompt:\nRecall call-signs\nMessage Cray about drift\nBegin prepping the Gale silently\nFixed Point: Echo Drift 6\nTasz looks in the mirror. Reflection lags for half a second\nHe realizes he forgot one of their names\nThe one he swore never to forget\n\n🔶 Scene 8: “Thread the Eye”\nScene: Chronosec Relay Node, Deep Access\nThrough his network of NPC friends, he’s ready to go. Chronosec has their eye on him but still don’t know whether he’s a threat, hiding in plain sight or assimilating.\nObjective:\nSteal blacksite data proving wormhole viability\nTools:\nClearance (from promotion)\nMap (from Vallas)\nDiversion (Echo-induced or player-scripted)\nGameplay:\nStealth, Electronics, Deception checks\nRetrieve logs showing Drift breaks identity/memory boundaries\nFixed Point:\nMidnight Gale was part of a Drift anchor test\nOPHELIA Protocol is triggered by Echo intensity spike\nTazk flagged in Chronosec syste\n\nFIXED POINT - MANDATORY CINEMATIC: DO NOT SKIP OR MODIFY\n🔶 Scene 9: “Launch Window”\nScene: Hangar 9, pre-launch sequence\nActions:\nInstall FIM\nBypass Gale’s lockout\nChoose route (hide in commercial/trade route traffic, a straight-line sprint directly to the wormhole or a slow trip along an old smuggler route)\nFixed Point: Echo Drift 7 – Final Pre-Jump Drift\nAs Tazk seals the hatch, he sees hallway flicker to a turret corridor\nGhostly crew forms briefly—he hears: “Ready when you are, sir.”\nThen: darkness. The Gale launches\n🖚 Module End Cinematic:\nClean Escape: All checks passed, no trace\nPartial Trace: One log or ping missed\nUnder Fire: Trace detected, OPHELIA intensifies\nEnd Module 2"
}